// اکسپرس جی اس به طور پیشفرض اجازه دسترسی به هیچ فایلی رو نمیده . 
// یعنی اگه در آدرس بار یو آر ال هر فایلی رو وارد کنیم اکسپرس اجازه دسترسی و دانلود اون فایل رو نمیده . 
// برای اینکه یکسری موارد رو مثل عکس های سایت . یا فایل سی اس اس جدا رو داشته باشیم . 
// برای مثال ما یک فایل سی اس اس داخل این ادرس داریم تو سایتمون public/styles/style.css
// حالا اگه بخوایم از این داخل فایل html که توسط res.sendFile ارسال کردیم دسترسی پیدا کنیم نمیشه . 
// قبلش باید داخل همون فایل js بیایم اینکار رو انجام بدیم . 
// از متد استاتیک که یک میدلور داخل اکسپرس هست استفاده میکنیم تا دسترسی بدیم به فولدر مورد نظرمون که public باشه برای دسترسی به فایل css
const express = require('express')
const app = express()


// سپس گفتیم . این متد مورد نظر ما و هر متدی داخل اکسپرس مثل بادی پارسر یا .... میدلور هستند و میدلور ها داخل اکسپرس به صورت 
app.use()
// استفاده میشوند . 
// حالا از متد استاتیک میخوایم استفاده کنیم . قبلش این نکته رو یاد آوری کنم که این متد هم مسیر کلی رو میگیره و برای این کار نیاز داریم که با ماژول path در نود کار کنیم path.join(__dirname,'public'); تا با استفاده از __dirname مسیر کلی رو بچسبونه به فولدر درخواستیمون

app.use(app.static(path.join(__dirname,'public')

// اینجا گفتیم هر چیزی هست داخل فولدر public رو بیاد استاتیک کنه تا به راحتی از داخل مرورگر قابل دسترس باشه . 



                   // در روت ها و میدلور ها و در انانیموس فانکشن های آنها req که نوشته میشود به مواردی مرتبط هست که از سمت کاربر به سمت برنامه ارسال میشود . در اصل از سمت مرورگر کاربر به سمت سرور ما ارسال میشود .
                   // و res مربوط به مواردی هست که ما قرار هست ارسال کنیم از سمت سرور به سمت کاربر . مثل send , sendFile , redirect و ....
