// میدلور ها در اکسپرس قابلیت این رو دارن که به صورت روت مشخص بشن 

const express = require('express');
const application = express()

application.use('/home',(req,res,next) => {
// در اینجا در 
  // route home 
  // این میدلر اجرا میشه 
  // ترتیب میدلور ها از بالا به پایینه
  // و میدلور هایی که روت نباشن روی همه روت ها اجرا میشن 
});


// روت خانه اصلی . یا روت پیشفرض باید در آخرین خط برنامه و بعد از تعریف کردن تمام روت ها تعریف شود



// مقدار req
// درخواستی های ارسالی از مرورگر به سرور و مقدار
// res 
// مقادیری هست که ما قراره از سرور به سمت مرورگر ارسال کنیم
