// شاید در پروژه  قبلی واستون سوال شده باشه که چطوری باید مقادیری که ارسال میشن توسط یک روت رو داخل روت دیگه دریافت و نمایش بدیم ؟ 

// همینطور که گفتم متغیر 
// req 
// که ما تو هر روت و میدلورمون تعریف کردیم و گفتم که میتونه هر چیزی باشه 
// این مقدار از سمت مرورگر کاربر ارسال میشه سمت سرور 
// پس هر مقداری که کاربر باهاش کار داشته باشه اینجا در دسترسه 
// ما الان میخوایم نوشته های کاربر که توسط فرم ارسال کرده رو بگیریم  پس داریم  : 

req.body.message // برای مثال نام اینپوت ما مسیج هست


// اما اینجا مشکلی که وجود داره اینه که نمیتونه بشناسه که چی هست و باید به یک فرمت قابل خوندن تبدیلش کنیم 
// میایم و پکیج 
// body-parser
// رو از ان پی ام میگیریم و نصبش میکنیم 
// سپس همینطور که قبلا گفتم همه موارد در اکسپرس یک میدلور هستن و میدلور ها از بالا شروع به خواندن میکنن و میان پایین تو فایل و برنامه 
// حالا بعد از نصب پکیج داریم : (در اول فایل)

const application = express()
const bodyParser = require('body-parser')

application.use(bodyParser.urlencoded({extended:false}));


// بعد از تعریف این الان با دسترسی به مقدار
req.body.message
// به هر روتی که ارسال کرده باشیم میتونیم مقدار رو دریافت کنیم . 
// در درس بعد یک پروژه صرفا فقط دریافت یک مقدار و ثبت و خواندن آن در فایل رو با اکسپرس جی اس پیاده سازی میکنم
// قسمت 8 رو از دست ندین 


